/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   rgb_conversion.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/02/07 11:39:17 by tchariss          #+#    #+#             */
/*   Updated: 2021/02/07 11:43:24 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// цвет можно подавать в цифрах rgb

int	hex_to_rgb(int red, int green, int blue)
{
	int r;
	int g;
	int b;

	r = 0x00FF0000;
	g = 0x0000FF00;
	b = 0x000000FF;
	return (r << 16 | g << 8 | b);
}

// draw_cub(cor_x, cor_y, &map, rgb_to_int(255, 105, 180)); // розовы